#### Vamos carregar

In [18]:
import pandas as pd
base = pd.read_csv('credit_data.csv')

#### Pra aproveitarmos o tratamento de valores incosistentes que ja foi dado no caderno 1, vamos colocar aqui as linhas de codigo pra atribuir o valor da media (sem as idades negativas) para as idades negativas

In [28]:
base.loc[base.age < 0, 'age'] = 40.92

In [27]:
base.loc[base.age < 0]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

In [21]:
base.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.927689   4444.369695     0.141500
std     577.494589  14326.327119    13.261825   3045.410024     0.348624
min       1.000000  20014.489470    18.055189      1.377630     0.000000
25%     500.750000  32796.459717    29.072097   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

#### O comando a seguir nos retorna true caso alguma idade n√£o esteja preenchida

In [22]:
pd.isnull(base['age'])

0       False
1       False
2       False
3       False
4       False
        ...
1995    False
1996    False
1997    False
1998    False
1999    False
Name: age, Length: 2000, dtype: bool

#### Nossa visualizacao pode nos enganar, mas observe que o comando a seguir nos informa que falta o preenchimento de 3 idades, alem disso

In [23]:
base.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.927689   4444.369695     0.141500
std     577.494589  14326.327119    13.261825   3045.410024     0.348624
min       1.000000  20014.489470    18.055189      1.377630     0.000000
25%     500.750000  32796.459717    29.072097   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

#### Podemos refinar o comando ja utilizado, colocando ele dentro de um loc, a fim de encontrar o que queremos

In [24]:
base.loc[pd.isnull(base['age'])]

    clientid        income  age         loan  default
28        29  59417.805406  NaN  2082.625938        0
30        31  48528.852796  NaN  6155.784670        0
31        32  23526.302555  NaN  2862.010139        0

#### Na nosa base podemos separar nossos atributos (no nosso caso as colunas) em dois tipos, previsores e classe. Pra utilizar algoritmos de aprendizagem de maquina no futuro e necessario fazer essa divisao, entao vamos a criacao dessas variaveis

#### Como o id da pessoa e uma informacao que nao reflete o resutado (se paga o emprestimo ou nao), por isso ela nao vai em nenhuma variavel

In [10]:
# vamos capturar todas linhas, e nas colunas vamos pegar da 1 a 3 inclusa deixando a coluna 0 e 4 de fora
previsores = base.iloc[:,1:4].values
# agora vamos caputar so a coluna default
classe = base.iloc[:,4].values

In [11]:
from sklearn.impute import SimpleImputer

In [12]:
import numpy as np

In [13]:
imputer = SimpleImputer(missing_values = np.nan, strategy = 'mean')

In [14]:
imputer = imputer.fit(previsores[:,0:3])

In [15]:
previsores[:,0:3] = imputer.fit_transform(previsores[:,0:3])

In [17]:
base.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000